edc/bass
jethrokuan/z
danhper/fish-ssh-agent
patrickf1/colored_man_pages.fish
jorgebucaran/fisher
jhillyerd/plugin-git
patrickf1/fzf.fish
plttn/fish-eza
