brew "quickjs"
brew "chezmoi"

brew "neovim"
brew "node"

brew "jj"
brew "lazyjj"
brew "jjui"
brew "git"
brew "lazygit"
brew "tmux"
brew "fish"
brew "fisher"
brew "zed"
brew "svn"
brew "yank"
brew "parallel"
brew "httpie"
# GPG sign keys
brew "gpg"
# Alternative to ls
brew "eza"
brew "fzf"
# Better git diff
brew "git-delta"
brew "ripgrep"
# Alternative to find
brew "fd"
# Alternative to cat
brew "bat"
brew "terminal-notifier"
# Cross-shell prompt config
brew "starship"
# GitHub CLI
brew "gh"
# TOML toolkit
brew "taplo"
# PReview markdown inside terminal
brew "glow"
# Lua package manager
brew "luarocks"
# Dockerfile linter
brew "hadolint"
# GitHub Actions linter
brew "actionlint"
# Alternative to watch
brew "viddy"
# Better monitoring dashboard
brew "btop"
# Command history manager
brew "atuin"
# Load testing
brew "k6"
# Terminal graphics
brew "viu"
brew "chafa"
brew "imagemagick"
# Structural search
brew "ast-grep"

cask "notion"
cask "notion-mail"
cask "notion-calendar"
cask "raycast"
cask "ghostty"
cask "karabiner-elements"
cask "obsidian"
cask "input-source-pro"
cask "tailscale-app"

brew "kubectl"
brew "helm"
brew "kubie"

cask "font-inconsolata"
cask "font-fira-code"
cask "font-inconsolata-g-for-powerline"
cask "font-inconsolata-lgc-nerd-font"
cask "font-sf-pro"
