brew "quickjs"

brew "neovim"

brew "git"
brew "tmux"
brew "fish"
brew "fisher"
brew "svn"
brew "isacikgoz/taps/tldr"
brew "yank"
brew "parallel"
brew "httpie"
brew "lazygit"
# GPG sign keys
brew "gpg"
# Alternative to ls
brew "exa"
brew "fzf"
# Better git diff
brew "git-delta"
brew "ripgrep"
# Alternative to find
brew "fd"
# Alternative to cat
brew "bat"
brew "terminal-notifier"
# Cross-shell prompt config
brew "starship"
# GitHub CLI
brew "gh"
# Python virtual environment manager
brew "pyenv"
brew "pyenv-virtualenv"
# TOML toolkit
brew "taplo"
# PReview markdown inside terminal
brew "glow"
# Lua package manager
brew "luarocks"
# Dockerfile linter
brew "hadolint"
# GitHub Actions linter
brew "actionlint"
# Alternative to watch
brew "viddy"
# Better monitoring dashboard
brew "btop"
# Command history manager
brew "atuin"
# Load testing
brew install k6
# Terminal graphics
brew "viu"
brew "chafa"
brew "jstkdng/programs/ueberzugpp"
brew "imagemagick"
# Structural search
brew "ast-grep"

cask "notion"
cask "raycast"
cask "ghostty"
cask "visual-studio-code"
cask "zoom"
cask "1password"
cask "1password/tap/1password-cli"
cask "karabiner-elements"
cask "obsidian"
cask "input-source-pro"
# i3-like window manager
cask "nikitabobko/tap/aerospace"

brew "kubectl"
brew "helm"
brew "kubie"
cask "google-cloud-sdk"
# lighter and faster docker on MacOS
brew "orbstack"

tap "snyk/tap"
brew "snyk"

tap "homebrew/cask-fonts"
cask "font-inconsolata"
cask "font-fira-code"
cask "font-inconsolata-g-for-powerline"
cask "font-inconsolata-lgc-nerd-font"

