brew "qlcolorcode"
cask "qlstephen"
brew "qlmarkdown"
brew "quicklook-json"
cask "qlimagesize"
brew "suspicious-package"
brew "apparency"
brew "quicklookase"
brew "qlvideo"

brew "git"
brew "tmux"
brew "fish"
brew "fisher"
brew "svn"
brew "isacikgoz/taps/tldr"
brew "yank"
brew "parallel"
brew "httpie"
# Alternative to ls
brew "exa"
brew "fzf"
# Better git diff
brew "git-delta"
brew "ripgrep"
# Alternative to find
brew "fd"
# Alternative to cat
brew "bat"
brew "terminal-notifier"
# Cross-shell prompt config
brew "starship"
# GitHub CLI
brew "gh"
# Python virtual environment manager
brew "pyenv"
brew "pyenv-virtualenv"
# TOML toolkit
brew "taplo"
# PReview markdown inside terminal
brew "glow"
# Lua package manager
brew "luarocks"
# Dockerfile linter
brew "hadolint"
# GitHub Actions linter
brew "actionlint"
# Alternative to watch
brew "viddy"
# Better monitoring dashboard
brew "btop"

cask "notion"
cask "raycast"
cask "alacritty"
cask "visual-studio-code"
cask "zoom"
cask "1password"
cask "1password/tap/1password-cli"
cask "karabiner-elements"
cask "obsidian"

brew "kubectl"
brew "helm"
brew "kubie"
cask "google-cloud-sdk"
cask "rancher"

tap "snyk/tap"
brew "snyk"

tap "homebrew/cask-fonts"
cask "font-inconsolata"
cask "font-fira-code"
cask "font-inconsolata-g-for-powerline"
cask "font-inconsolata-lgc-nerd-font"

cask "homebrew/cask-drivers/logi-options-plus"
