jorgebucaran/fisher
jethrokuan/z
edc/bass
jethrokuan/fzf
danhper/fish-ssh-agent
gazorby/fish-abbreviation-tips
jhillyerd/plugin-git
patrickf1/colored_man_pages.fish
